# 1. Використовуємо офіційний образ Python (це наша "базова ОС")
FROM python:3.12-slim

# 2. Встановлюємо робочу папку всередині контейнера
WORKDIR /app

# 3. Копіюємо файл зі списком бібліотек у контейнер
COPY requirements.txt .

# 4. Встановлюємо ці бібліотеки всередині контейнера
RUN pip install --no-cache-dir -r requirements.txt

# 5. Копіюємо весь наш код (main.py та інші) у контейнер
COPY . .

# 6. Команда, яка запустить додаток, коли контейнер стартує
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000"]